In [2]:
import pandas as pd

In [3]:
#Creation of Series
a = [5,2,7,4,1]
s = pd.Series(data=a)

In [4]:
s

0    5
1    2
2    7
3    4
4    1
dtype: int64

In [5]:
b = [8,11,15,17,25]
s1 = pd.Series(data=b)
s1

0     8
1    11
2    15
3    17
4    25
dtype: int64

In [6]:
#Basic arithmetic operations 
s+s1

0    13
1    13
2    22
3    21
4    26
dtype: int64

In [7]:
s-s1

0    -3
1    -9
2    -8
3   -13
4   -24
dtype: int64

In [8]:
s*s1

0     40
1     22
2    105
3     68
4     25
dtype: int64

In [9]:
s/s1

0    0.625000
1    0.181818
2    0.466667
3    0.235294
4    0.040000
dtype: float64

In [10]:
s**s1

0           390625
1             2048
2    4747561509943
3      17179869184
4                1
dtype: int64

In [11]:
s%s1

0    5
1    2
2    7
3    4
4    1
dtype: int64

In [12]:
s//s1

0    0
1    0
2    0
3    0
4    0
dtype: int64

In [13]:
c = [1,2,3,4,5]

In [14]:
d = ['one','two','three','four','five']

In [15]:
type(c)

list

In [16]:
c

[1, 2, 3, 4, 5]

In [17]:
s = pd.Series(data=a,index=c)

In [18]:
s

1    5
2    2
3    7
4    4
5    1
dtype: int64

In [19]:
s = pd.Series(data=a,index=d)

In [20]:
s

one      5
two      2
three    7
four     4
five     1
dtype: int64

In [21]:
s1 = pd.Series(data=b,index=d)
s1

one       8
two      11
three    15
four     17
five     25
dtype: int64

In [22]:
s = pd.Series(a,d)
s

one      5
two      2
three    7
four     4
five     1
dtype: int64

In [23]:
s1 = pd.Series(b,d)

In [24]:
s1

one       8
two      11
three    15
four     17
five     25
dtype: int64

In [25]:
s = pd.Series(data=a,index=[1,2,3,4,5])
s

1    5
2    2
3    7
4    4
5    1
dtype: int64

In [26]:
s = pd.Series(data=a,index=['one','two','three','four','five'])
s

one      5
two      2
three    7
four     4
five     1
dtype: int64

In [27]:
s1 = pd.Series(data=b,index=['one','two','three','four','five'])
s1

one       8
two      11
three    15
four     17
five     25
dtype: int64

In [82]:
s

one      5
two      2
three    7
four     4
five     1
dtype: int64

In [83]:
s1

one       8
two      11
three    15
four     17
five     25
dtype: int64

In [28]:
#concat - Joining of two series from columns and automatic creation of a data frame
df1 = pd.concat([s,s1],axis=1)

In [29]:
df1

       0   1
one    5   8
two    2  11
three  7  15
four   4  17
five   1  25

In [30]:
s

one      5
two      2
three    7
four     4
five     1
dtype: int64

In [31]:
s1

one       8
two      11
three    15
four     17
five     25
dtype: int64

In [32]:
type(df1)

pandas.core.frame.DataFrame

In [33]:
#concat - Joining of two series from rows.
#The end outcome will also result in a series
df2 = pd.concat([s,s1],axis=0)

In [34]:
df2

one       5
two       2
three     7
four      4
five      1
one       8
two      11
three    15
four     17
five     25
dtype: int64

In [35]:
type(df2)

pandas.core.series.Series

In [36]:
import numpy as np

In [37]:
#Creation of a data frame
df3 = pd.DataFrame(np.random.randn(5,5))

In [38]:
df3

          0         1         2         3         4
0 -0.373898 -0.474145  0.614979  0.785583 -0.634452
1  1.557984 -0.308716  0.085920 -0.325518 -1.947572
2  0.090482 -0.273892 -1.753362  0.233128  0.699863
3 -1.382653  0.177407 -0.192794 -0.834401 -1.764331
4 -0.592204 -0.193043  1.058954  0.885815  0.545031

In [39]:
df3.shape

(5, 5)

In [40]:
columns = ['zeroth_col','first_col','second_col','third_col','fourth_col']
rows = ['zeroth_row','first_row','second_row','third_row','fourth_row']

In [41]:
df = pd.DataFrame(data = np.random.randn(5,5),index=rows,columns=columns)

In [42]:
df

            zeroth_col  first_col  second_col  third_col  fourth_col
zeroth_row   -2.072030   1.073720    0.800532  -0.998065    1.036825
first_row     1.450970   0.517635    0.259304   0.164285   -1.130995
second_row   -0.065364  -1.524064   -0.375354   1.711469    0.827991
third_row    -0.391266   0.148391   -0.493540   0.704497   -0.153961
fourth_row   -0.952707  -0.671805    1.465860  -0.627640   -0.101273

In [43]:
#Top 5 rows
df.head(5)

            zeroth_col  first_col  second_col  third_col  fourth_col
zeroth_row   -2.072030   1.073720    0.800532  -0.998065    1.036825
first_row     1.450970   0.517635    0.259304   0.164285   -1.130995
second_row   -0.065364  -1.524064   -0.375354   1.711469    0.827991
third_row    -0.391266   0.148391   -0.493540   0.704497   -0.153961
fourth_row   -0.952707  -0.671805    1.465860  -0.627640   -0.101273

In [44]:
#bottom 5 rows
df.tail()

            zeroth_col  first_col  second_col  third_col  fourth_col
zeroth_row   -2.072030   1.073720    0.800532  -0.998065    1.036825
first_row     1.450970   0.517635    0.259304   0.164285   -1.130995
second_row   -0.065364  -1.524064   -0.375354   1.711469    0.827991
third_row    -0.391266   0.148391   -0.493540   0.704497   -0.153961
fourth_row   -0.952707  -0.671805    1.465860  -0.627640   -0.101273

In [45]:
#Accessing/displaying of single column in series
df['fourth_col']

zeroth_row    1.036825
first_row    -1.130995
second_row    0.827991
third_row    -0.153961
fourth_row   -0.101273
Name: fourth_col, dtype: float64

In [46]:
#Accessing/displaying of single column in dataframe
df[['fourth_col']]

            fourth_col
zeroth_row    1.036825
first_row    -1.130995
second_row    0.827991
third_row    -0.153961
fourth_row   -0.101273

In [47]:
df[['zeroth_col']]

            zeroth_col
zeroth_row   -2.072030
first_row     1.450970
second_row   -0.065364
third_row    -0.391266
fourth_row   -0.952707

In [48]:
df[['second_col']]

            second_col
zeroth_row    0.800532
first_row     0.259304
second_row   -0.375354
third_row    -0.493540
fourth_row    1.465860

In [49]:
#Access multiple columns in a dataframe
df[['fourth_col','zeroth_col']]

            fourth_col  zeroth_col
zeroth_row    1.036825   -2.072030
first_row    -1.130995    1.450970
second_row    0.827991   -0.065364
third_row    -0.153961   -0.391266
fourth_row   -0.101273   -0.952707

In [50]:
df[['fourth_col','zeroth_col','second_col']]

            fourth_col  zeroth_col  second_col
zeroth_row    1.036825   -2.072030    0.800532
first_row    -1.130995    1.450970    0.259304
second_row    0.827991   -0.065364   -0.375354
third_row    -0.153961   -0.391266   -0.493540
fourth_row   -0.101273   -0.952707    1.465860

In [51]:
df

            zeroth_col  first_col  second_col  third_col  fourth_col
zeroth_row   -2.072030   1.073720    0.800532  -0.998065    1.036825
first_row     1.450970   0.517635    0.259304   0.164285   -1.130995
second_row   -0.065364  -1.524064   -0.375354   1.711469    0.827991
third_row    -0.391266   0.148391   -0.493540   0.704497   -0.153961
fourth_row   -0.952707  -0.671805    1.465860  -0.627640   -0.101273

In [52]:
#Accessing of rows in series using .loc function
df.loc['first_row']

zeroth_col    1.450970
first_col     0.517635
second_col    0.259304
third_col     0.164285
fourth_col   -1.130995
Name: first_row, dtype: float64

In [53]:
df.loc[['first_row']] #Accessing of rows in a data frame

           zeroth_col  first_col  second_col  third_col  fourth_col
first_row     1.45097   0.517635    0.259304   0.164285   -1.130995

In [54]:
df.loc[['first_row']].T #Transposing a dataframe using .loc function

            first_row
zeroth_col   1.450970
first_col    0.517635
second_col   0.259304
third_col    0.164285
fourth_col  -1.130995

In [55]:
#Accessing of multiple rows 
df.loc[['second_row','zeroth_row']]

            zeroth_col  first_col  second_col  third_col  fourth_col
second_row   -0.065364  -1.524064   -0.375354   1.711469    0.827991
zeroth_row   -2.072030   1.073720    0.800532  -0.998065    1.036825

In [56]:
df.loc[['zeroth_row','second_row']].T

            zeroth_row  second_row
zeroth_col   -2.072030   -0.065364
first_col     1.073720   -1.524064
second_col    0.800532   -0.375354
third_col    -0.998065    1.711469
fourth_col    1.036825    0.827991

In [57]:
df

            zeroth_col  first_col  second_col  third_col  fourth_col
zeroth_row   -2.072030   1.073720    0.800532  -0.998065    1.036825
first_row     1.450970   0.517635    0.259304   0.164285   -1.130995
second_row   -0.065364  -1.524064   -0.375354   1.711469    0.827991
third_row    -0.391266   0.148391   -0.493540   0.704497   -0.153961
fourth_row   -0.952707  -0.671805    1.465860  -0.627640   -0.101273

In [58]:
#Add a column using np.random.randn
df['fifth_col'] = np.random.randn(5,1)

In [59]:
df

,zeroth_col,first_col,second_col,third_col,fourth_col,fifth_col
zeroth_row,-2.072030,1.073720,0.800532,-0.998065,1.036825,-0.055415
first_row,1.450970,0.517635,0.259304,0.164285,-1.130995,-0.205738
second_row,-0.065364,-1.524064,-0.375354,1.711469,0.827991,0.586820
third_row,-0.391266,0.148391,-0.493540,0.704497,-0.153961,0.254378
fourth_row,-0.952707,-0.671805,1.465860,-0.627640,-0.101273,1.005795

In [60]:
#Column Operations in another column
df['subtract_col'] = df['fifth_col'] - df['fourth_col']

In [61]:
df

,zeroth_col,first_col,second_col,third_col,fourth_col,fifth_col,subtract_col
zeroth_row,-2.072030,1.073720,0.800532,-0.998065,1.036825,-0.055415,-1.092240
first_row,1.450970,0.517635,0.259304,0.164285,-1.130995,-0.205738,0.925257
second_row,-0.065364,-1.524064,-0.375354,1.711469,0.827991,0.586820,-0.241171
third_row,-0.391266,0.148391,-0.493540,0.704497,-0.153961,0.254378,0.408338
fourth_row,-0.952707,-0.671805,1.465860,-0.627640,-0.101273,1.005795,1.107068

In [62]:
#accessing of rows using .iloc function in series 
df.iloc[0]

zeroth_col     -2.072030
first_col       1.073720
second_col      0.800532
third_col      -0.998065
fourth_col      1.036825
fifth_col      -0.055415
subtract_col   -1.092240
Name: zeroth_row, dtype: float64

In [63]:
df.iloc[[2]] #accessing of rows using .iloc in a dataframe

,zeroth_col,first_col,second_col,third_col,fourth_col,fifth_col,subtract_col
second_row,-0.065364,-1.524064,-0.375354,1.711469,0.827991,0.58682,-0.241171

In [64]:
df.iloc[[3,2]].T

              third_row  second_row
zeroth_col    -0.391266   -0.065364
first_col      0.148391   -1.524064
second_col    -0.493540   -0.375354
third_col      0.704497    1.711469
fourth_col    -0.153961    0.827991
fifth_col      0.254378    0.586820
subtract_col   0.408338   -0.241171

In [65]:
np.random.randn(1,1)

array([[-1.970083]])

In [66]:
df.drop('subtract_col',axis=1,inplace=True)

In [67]:
df2 = pd.DataFrame({'zeroth_col': [np.random.randn(1,1)], 'first_col': [np.random.randn(1,1)],'second_col':[np.random.randn(1,1)],'third_col':[np.random.randn(1,1)],'fourth_col':[np.random.randn(1,1)],'fifth_col':[np.random.randn(1,1)]})

In [68]:
df = df.append(df2,ignore_index=True)

C:\Users\PKVidyarthi\AppData\Local\Temp\ipykernel_33936\182344781.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2,ignore_index=True)

In [69]:
df.head(7)

,zeroth_col,first_col,second_col,third_col,fourth_col,fifth_col
0,-2.07203,1.07372,0.800532,-0.998065,1.036825,-0.055415
1,1.45097,0.517635,0.259304,0.164285,-1.130995,-0.205738
2,-0.065364,-1.524064,-0.375354,1.711469,0.827991,0.58682
3,-0.391266,0.148391,-0.49354,0.704497,-0.153961,0.254378
4,-0.952707,-0.671805,1.46586,-0.62764,-0.101273,1.005795
5,[[-0.9633301369692453]],[[-0.08438772774132156]],[[-0.6667732777548351]],[[-0.33192438958895837]],[[-1.337597261420002]],[[0.8235733090785694]]

In [70]:
df.shape

(6, 6)

In [71]:
#dropping off a column using drop function
df.drop('fifth_col',axis=1,inplace=True)

In [72]:
df

,zeroth_col,first_col,second_col,third_col,fourth_col
0,-2.07203,1.07372,0.800532,-0.998065,1.036825
1,1.45097,0.517635,0.259304,0.164285,-1.130995
2,-0.065364,-1.524064,-0.375354,1.711469,0.827991
3,-0.391266,0.148391,-0.49354,0.704497,-0.153961
4,-0.952707,-0.671805,1.46586,-0.62764,-0.101273
5,[[-0.9633301369692453]],[[-0.08438772774132156]],[[-0.6667732777548351]],[[-0.33192438958895837]],[[-1.337597261420002]]

In [73]:
#Creation of a data frame from scratch
df1 = pd.DataFrame({'Laptop':['Dell','Lenovo','HP','Asus','Acer','Apple'],'Rating Out of 5':[3.5,3,4,4.25,3,5]})

In [74]:
df1

   Laptop  Rating Out of 5
0    Dell             3.50
1  Lenovo             3.00
2      HP             4.00
3    Asus             4.25
4    Acer             3.00
5   Apple             5.00

In [75]:
df1.shape

(6, 2)

In [76]:
df2 = pd.DataFrame({'CPU':['Core i7','Core i3','Core i5','Core i9','AMD Ryzen','M1/M2'],'GPU':['GTX','GTE','GTE3080','GTE3060','GTE3040','M1/M2']})

In [77]:
df2

         CPU      GPU
0    Core i7      GTX
1    Core i3      GTE
2    Core i5  GTE3080
3    Core i9  GTE3060
4  AMD Ryzen  GTE3040
5      M1/M2    M1/M2

In [78]:
df2.shape

(6, 2)

In [79]:
#Concatenate/ Join of a data frame through columns
df = pd.concat([df1,df2],axis=1)

In [80]:
df

   Laptop  Rating Out of 5        CPU      GPU
0    Dell             3.50    Core i7      GTX
1  Lenovo             3.00    Core i3      GTE
2      HP             4.00    Core i5  GTE3080
3    Asus             4.25    Core i9  GTE3060
4    Acer             3.00  AMD Ryzen  GTE3040
5   Apple             5.00      M1/M2    M1/M2

In [81]:
#Converting a data frame into a csv file 
df.to_csv('PC_Data.csv')